### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [3]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [4]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
# Check to see if a player purchased multiple times
player = purchase_data["SN"].value_counts()
player.head()

Lisosia93      5
Iral74         4
Idastidru52    4
Umolrian85     3
Lisopela58     3
Name: SN, dtype: int64

In [6]:
player_count = len(purchase_data["SN"].unique())
player_count

576

In [7]:
player_count_df = pd.DataFrame({"Total Players": [player_count]})
player_count_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:
# Check to see if items are purchased multiple times
items_name = purchase_data["Item Name"].value_counts()
items_name.head()

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Persuasion                                       9
Fiery Glass Crusader                             9
Nirvana                                          9
Name: Item Name, dtype: int64

In [9]:
unique_item_count = len(purchase_data["Item Name"].unique())
unique_item_count

179

In [10]:
average_price = purchase_data["Price"].mean()
average_price

3.0509871794871795

In [11]:
purchase_count = purchase_data["Purchase ID"].count()
purchase_count

780

In [12]:
revenue = purchase_data["Price"].sum()
revenue

2379.77

In [13]:
summary_df = pd.DataFrame({"Number of Unique Items":[unique_item_count],
                          "Average Price":[average_price],
                          "Number of Purchases":[purchase_count],
                          "Total Revenue":[revenue]})
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [14]:
summary_df.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [15]:
summary_df["Average Price"]= pd.to_numeric(summary_df["Average Price"])

In [16]:
summary_df["Average Price"] = summary_df["Average Price"].astype(float).map("${:,.2f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].astype(float).map("${:,.2f}".format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [17]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [18]:
gender_demographics = purchase_data[["SN","Gender"]]
gender_demographics

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [19]:
updated_gender_demographics = gender_demographics.drop_duplicates()
updated_gender_demographics

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [20]:
gender_list = list(updated_gender_demographics["Gender"].unique())
gender_list

['Male', 'Other / Non-Disclosed', 'Female']

In [21]:
# Reorder the gender list
updated_gender_list = ["Male", "Female", "Other / Non-Disclosed"]
updated_gender_list

['Male', 'Female', 'Other / Non-Disclosed']

In [22]:
male_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Male"])
male_count

484

In [23]:
female_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Female"])
female_count

81

In [24]:
others_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Other / Non-Disclosed"])
others_count

11

In [25]:
player_count = len(purchase_data["SN"].unique())
player_count

576

In [26]:
total_count = [male_count,
             female_count,
             others_count]
total_count

[484, 81, 11]

In [27]:
gender_percentage = [(male_count/player_count)*100,
             (female_count/player_count)*100,
            (others_count/player_count)*100]
gender_percentage

[84.02777777777779, 14.0625, 1.9097222222222223]

In [28]:
gender_demographics_df = pd.DataFrame({"": updated_gender_list,"Total Count": total_count,
                                       "Percentage of Players": gender_percentage})
gender_demographics_df

                          Total Count  Percentage of Players
0                   Male          484              84.027778
1                 Female           81              14.062500
2  Other / Non-Disclosed           11               1.909722

In [29]:
gender_demographics_df.set_index("", inplace=True)
gender_demographics_df

                       Total Count  Percentage of Players

Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [30]:
gender_demographics_df.dtypes

Total Count                int64
Percentage of Players    float64
dtype: object

In [31]:
gender_demographics_df["Percentage of Players"]= pd.to_numeric(gender_demographics_df["Percentage of Players"])

In [32]:
gender_demographics_df["Percentage of Players"] = gender_demographics_df["Percentage of Players"].astype(float).map("{:,.2f}%".format)
gender_demographics_df

                       Total Count Percentage of Players

Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [33]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [34]:
gender_group = purchase_data.groupby("Gender")
gender_group.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [35]:
purchase_count = gender_group["Purchase ID"].count()
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [36]:
average_purchase = gender_group["Price"].mean()
average_purchase

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [37]:
total_purchase = gender_group["Price"].sum()
total_purchase

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [38]:
# Utilizing the unique gender count from the previous section
total_count_pa = [female_count,
               male_count,
             others_count]
total_count_pa

[81, 484, 11]

In [39]:
avg_total_purchase = total_purchase/total_count_pa
avg_total_purchase

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
Name: Price, dtype: float64

In [40]:
purchase_analysis_gender_df = pd.DataFrame ({"Purchase Count": purchase_count,
                                            "Average Purchase Price": average_purchase,
                                            "Total Purchase Value": total_purchase,
                                            "Average Purchase Total per Person": avg_total_purchase })
purchase_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [41]:
purchase_analysis_gender_df["Average Purchase Price"] = purchase_analysis_gender_df["Average Purchase Price"].astype(float).map("${:,.2f}".format)
purchase_analysis_gender_df["Total Purchase Value"] = purchase_analysis_gender_df["Total Purchase Value"].astype(float).map("${:,.2f}".format)
purchase_analysis_gender_df["Average Purchase Total per Person"] = purchase_analysis_gender_df["Average Purchase Total per Person"].astype(float).map("${:,.2f}".format)
purchase_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [42]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [43]:
new_purchase_data=purchase_data.drop_duplicates(subset=["SN"])
new_purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [44]:
age_bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 50]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [45]:
age_purchase_data = new_purchase_data.copy() #use copy() to avoid settingwithcopywarning

In [46]:
age_purchase_data["Age Group"]=pd.cut(purchase_data["Age"], age_bins, labels= age_labels)
age_purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02,20-24
774,774,Jiskjask80,11,Male,92,Final Critic,4.19,10-14
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10

In [47]:
age_purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price',
       'Age Group'],
      dtype='object')

In [48]:
new_columns = ["SN","Age Group"]

In [49]:
new_age_purchase_data= age_purchase_data[new_columns]
new_age_purchase_data

                SN Age Group
0          Lisim78     20-24
1      Lisovynya38       40+
2       Ithergue48     20-24
3    Chamassasya86     20-24
4        Iskosia90     20-24
..             ...       ...
773         Hala31     20-24
774     Jiskjask80     10-14
775     Aethedru70     20-24
777     Yathecal72     20-24
778        Sisur91       <10

[576 rows x 2 columns]

In [50]:
organized_age_purchase_data=new_age_purchase_data.groupby("Age Group")
organized_age_purchase_data

In [51]:
age_group_SN = organized_age_purchase_data.count()
age_group_SN

            SN
Age Group
<10         17
10-14       22
15-19      107
20-24      258
25-29       77
30-34       52
35-39       31
40+         12

In [52]:
age_group = age_labels
age_group

['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [112]:
total_count = list(age_group_SN["SN"])
total_count

[17, 22, 107, 258, 77, 52, 31, 12]

In [113]:
total_players = new_purchase_data["SN"].count()
total_players

576

In [114]:
percentage_players = (total_count/total_players) *100
percentage_players

array([ 2.95138889,  3.81944444, 18.57638889, 44.79166667, 13.36805556,
        9.02777778,  5.38194444,  2.08333333])

In [115]:
age_demographics_df = pd.DataFrame ({"": age_group, 
                                     "Total Count": total_count, 
                                     "Percentage of Players": percentage_players})
age_demographics_df

          Total Count  Percentage of Players
0    <10           17               2.951389
1  10-14           22               3.819444
2  15-19          107              18.576389
3  20-24          258              44.791667
4  25-29           77              13.368056
5  30-34           52               9.027778
6  35-39           31               5.381944
7    40+           12               2.083333

In [116]:
age_demographics_df.set_index("", inplace=True)
age_demographics_df

       Total Count  Percentage of Players

<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
40+             12               2.083333

In [117]:
age_demographics_df["Percentage of Players"] = age_demographics_df["Percentage of Players"].astype(float).map("{:,.2f}%".format)
age_demographics_df

       Total Count Percentage of Players

<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [118]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [156]:
age_bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 50]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [157]:
purchase_data["Age Ranges"]=pd.cut(purchase_data["Age"], age_bins, labels= age_labels)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24,20-24
...,...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24,20-24

In [169]:
age_groupby_purchase_data = purchase_data.groupby("Age Ranges")

In [184]:
purchase_count = age_groupby_purchase_data.count()
purchase_count

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
Age Ranges,,,,,,,,
<10,23,23,23,23,23,23,23,23
10-14,28,28,28,28,28,28,28,28
15-19,136,136,136,136,136,136,136,136
20-24,365,365,365,365,365,365,365,365
25-29,101,101,101,101,101,101,101,101
30-34,73,73,73,73,73,73,73,73
35-39,41,41,41,41,41,41,41,41
40+,13,13,13,13,13,13,13,13

In [185]:
avg_purchase_price = age_groupby_purchase_data["Price"].mean()
avg_purchase_price

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [186]:
total_purchase_value = age_groupby_purchase_data["Price"].sum()
total_purchase_value

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [187]:
# Utilizing each age group's non-repeated total count from the last section
purchase_analysis_total_count = total_count
purchase_analysis_total_count

[17, 22, 107, 258, 77, 52, 31, 12]

In [188]:
avg_total_purchase = total_purchase_value_raw/purchase_analysis_total_count
avg_total_purchase

Age Ranges
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
Name: Price, dtype: float64

In [189]:
age_purchase_analysis_df = pd.DataFrame ({"Purchase Count":purchase_count["Purchase ID"],
                                         "Average Purchase Price": avg_purchase_price,
                                         "Total Purchase Value": total_purchase_value,
                                         "Average Purchase Total per Person":avg_total_purchase})
age_purchase_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [190]:
age_purchase_analysis_df["Average Purchase Price"] = age_purchase_analysis_df["Average Purchase Price"].astype(float).map("${:,.2f}".format)
age_purchase_analysis_df["Total Purchase Value"] = age_purchase_analysis_df["Total Purchase Value"].astype(float).map("${:,.2f}".format)
age_purchase_analysis_df["Average Purchase Total per Person"] = age_purchase_analysis_df["Average Purchase Total per Person"].astype(float).map("${:,.2f}".format)
age_purchase_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame